In [ ]:
import pandas as pd

In [ ]:
sr1=pd.Series([1,2,3,4,5])
sr1

In [ ]:
sr2=pd.Series([3,4,5,6,7,8,9])
sr2

In [ ]:
pd.concat([sr1,sr2])

In [ ]:
#creating data using pandas datafram
df1=pd.DataFrame({'id':[1,2,3,4,8,11,12],'names':['A','B','C','D','e','f','g'],'class':['one','two','three','four','five','six','seven']})

In [ ]:

df2=pd.DataFrame({'id':[5,6,7,8],'names':['Ab','Bc','Cd','Df'],'class':['one','two','three','four']})

In [ ]:
pd.concat([df1,df2])#by dafualt data is added by rows

In [ ]:
# we can added data by cols
pd.concat([df1,df2],axis=1)

In [ ]:
# we can added data by cols
pd.concat([df1,df2],axis=1,ignore_index=True)

In [ ]:
# we can added data by cols
pd.concat([df1,df2],axis=0,ignore_index=True)

In [ ]:
# inner mean intersection and outer mean union
pd.concat([df1,df2],axis=1,join='inner')

In [ ]:
# inner mean intersection and outer mean union
pd.concat([df1,df2],axis=1,join='outer')

In [ ]:
pd.concat([df1,df2],keys=['df1','df2'])# identify the data starting point

In [ ]:
pd.concat([df1,df2],axis=1,keys=[' first','2nd '])

In [ ]:

df2=pd.DataFrame({'id':[5,6,7,8],'names':['Ab','Bc','Cd','Df'],'class':['one','two','three','four']})

In [62]:

df3=pd.DataFrame({'marks':[5,6,7,8]},index=['a','b','c','d'])

In [53]:
pd.concat([df2,df3],sort=True)

   class   id  marks names
0    one  5.0    NaN    Ab
1    two  6.0    NaN    Bc
2  three  7.0    NaN    Cd
3   four  8.0    NaN    Df
a    NaN  NaN    5.0   NaN
b    NaN  NaN    6.0   NaN
c    NaN  NaN    7.0   NaN
d    NaN  NaN    8.0   NaN

In [54]:
display(df2,df3)

   id names  class
0   5    Ab    one
1   6    Bc    two
2   7    Cd  three
3   8    Df   four

   marks
a      5
b      6
c      7
d      8

In [64]:
df2.join(df3,)# both data must have same index than it will not show nan

   id names  class  marks
0   5    Ab    one    NaN
1   6    Bc    two    NaN
2   7    Cd  three    NaN
3   8    Df   four    NaN

In [65]:

df3=pd.DataFrame({'class':[5,6,7,8]},index=['a','b','c','d'])

In [ ]:
df2.join(df3,rsuffix='-1')# both data must have same index than it will not show nan